- **Terraform formatting and style 🖌 ``**
- **Terraform initialization ⚙️ `success`**
- **Terraform plan 📖 `success`**
- **Terraform validation 🤖 `success`**
<details><summary>Show plan output</summary>
```

module.processing_queue["prod"].data.archive_file.processing_lambda_source: Reading...
module.frontend_bucket["prod"].data.aws_iam_openid_connect_provider.example: Reading...
module.frontend_bucket["prod"].aws_cloudfront_origin_access_identity.frontend_oai: Refreshing state... [id=EKGC0XQKA7JD2]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.frontend_bucket["prod"].aws_s3_bucket.frontend_s3_bucket: Refreshing state... [id=bata-media-frontend-prod]
module.photo_bucket["prod"].aws_s3_bucket.photo_s3_bucket: Refreshing state... [id=bata-media-photo-prod]
module.frontend_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-frontend-prod-upload-user]
module.frontend_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-frontend-prod-upload-user-2025032820223431810000000d]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue-dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-prod-dlq]
module.frontend_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-frontend-prod-upload-policy]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
aws_s3_bucket.mysql_backup_bucket: Refreshing state... [id=bata-media-db-backup]
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Read complete after 1s [id=fb70dcde426ba054310a7f82bbae6ec77842e28e]
module.photo_bucket["prod"].aws_cloudfront_origin_access_identity.photo_oai: Refreshing state... [id=E2L20GH2AV9ZRW]
module.processing_queue["prod"].aws_iam_role.lambda-execution-role: Refreshing state... [id=media-photo-processing-prod-execution-role]
module.frontend_bucket["prod"].data.aws_iam_openid_connect_provider.example: Read complete after 0s [id=arn:aws:iam::172483268424:oidc-provider/token.actions.githubusercontent.com]
module.processing_queue["prod"].aws_lambda_function.processing_lambda: Refreshing state... [id=photo-processing-lambda-prod]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-prod]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Read complete after 0s [id=2010748321]
module.processing_queue["prod"].aws_iam_policy.lambda-role-policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/media-photo-processing-prod-processing-policy]
module.processing_queue["prod"].aws_iam_role_policy_attachment.lambda-execution-role-policy: Refreshing state... [id=media-photo-processing-prod-execution-role-20250328201712565400000008]
module.processing_queue["prod"].aws_lambda_event_source_mapping.processing_lambda_event_mapping: Refreshing state... [id=016be879-7beb-4bdb-af72-9f3abcf6f087]
aws_iam_user.mysql_backup_upload_user: Refreshing state... [id=bata-media-db-backup-db-backup-user]
aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=bata-media-db-backup]
aws_s3_bucket_public_access_block.mysql_s3_bucket_public_acl: Refreshing state... [id=bata-media-db-backup]
aws_iam_policy.mysql_backup_upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-db-backup-db-backup-policy]
aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle: Refreshing state... [id=bata-media-db-backup]
module.frontend_bucket["prod"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["prod"].aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["prod"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["prod"].aws_cloudfront_distribution.frontend_cloudfront_distribution: Refreshing state... [id=E38Z5KAIBO7480]
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Reading...
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Read complete after 0s [id=1577279431]
module.photo_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-photo-prod-upload-user]
module.photo_bucket["prod"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Reading...
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Read complete after 0s [id=1452836004]
module.photo_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-photo-prod-upload-policy]
module.frontend_bucket["prod"].aws_s3_bucket_policy.frontend_s3_bucket_policy: Refreshing state... [id=bata-media-frontend-prod]
aws_iam_user_policy_attachment.mysql_backup_user_attachment: Refreshing state... [id=bata-media-db-backup-db-backup-user-20250328201628443000000007]
module.photo_bucket["prod"].aws_s3_bucket_policy.photo_s3_bucket_policy: Refreshing state... [id=bata-media-photo-prod]
aws_s3_bucket_acl.mysql_s3_bucket_acl: Refreshing state... [id=bata-media-db-backup,private]
module.frontend_bucket["prod"].aws_s3_bucket_acl.frontend_s3_bucket_acl: Refreshing state... [id=bata-media-frontend-prod,private]
module.photo_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-photo-prod-upload-user-2025032820173573590000000b]
module.route53["prod"].aws_route53_record.frontend_bucket_record_apex_a[0]: Refreshing state... [id=Z0501357TFKZ7NM83UD2__A]
module.photo_bucket["prod"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy: Refreshing state... [id=a2b677b2-9e82-45ba-a596-f02bbd373d52]
module.route53["prod"].aws_route53_record.frontend_bucket_record_apex_aaaa[0]: Refreshing state... [id=Z0501357TFKZ7NM83UD2__AAAA]
module.route53["prod"].aws_route53_record.frontend_bucket_record_a: Refreshing state... [id=Z0501357TFKZ7NM83UD2_www_A]
module.route53["prod"].aws_route53_record.frontend_bucket_record_aaaa: Refreshing state... [id=Z0501357TFKZ7NM83UD2_www_AAAA]
module.photo_bucket["prod"].aws_cloudfront_distribution.photo_cloudfront_distribution: Refreshing state... [id=E33EP76ZM4MG42]
module.route53["prod"].aws_route53_record.photo_bucket_record_aaaa: Refreshing state... [id=Z0501357TFKZ7NM83UD2_assets_AAAA]
module.route53["prod"].aws_route53_record.photo_bucket_record_a: Refreshing state... [id=Z0501357TFKZ7NM83UD2_assets_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.frontend_bucket["prod"].aws_iam_policy.upload_role_policy will be created
  + resource "aws_iam_policy" "upload_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "bata-media-frontend-prod-upload-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:PutObjectAcl",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::bata-media-frontend-prod/*"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::bata-media-frontend-prod"
                    },
                  + {
                      + Action   = "cloudfront:CreateInvalidation"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudfront::172483268424:distribution/E38Z5KAIBO7480"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.frontend_bucket["prod"].aws_iam_policy.upload_user_policy will be destroyed
  # (because aws_iam_policy.upload_user_policy is not in configuration)
  - resource "aws_iam_policy" "upload_user_policy" {
      - arn              = "arn:aws:iam::172483268424:policy/bata-media-frontend-prod-upload-policy" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::172483268424:policy/bata-media-frontend-prod-upload-policy" -> null
      - name             = "bata-media-frontend-prod-upload-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:PutObjectAcl",
                          - "s3:GetObject",
                          - "s3:HeadObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::bata-media-frontend-prod/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::bata-media-frontend-prod"
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::172483268424:distribution/E38Z5KAIBO7480"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPASQKGNZ5ENJVTKNAP2" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.frontend_bucket["prod"].aws_iam_role.frontend_upload_role will be created
  + resource "aws_iam_role" "frontend_upload_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:kickin-media/media-front-end:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::172483268424:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bata-media-frontend-prod-upload-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.frontend_bucket["prod"].aws_iam_role_policy_attachment.upload_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "upload_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "bata-media-frontend-prod-upload-role"
    }

  # module.frontend_bucket["prod"].aws_iam_user.upload_user will be destroyed
  # (because aws_iam_user.upload_user is not in configuration)
  - resource "aws_iam_user" "upload_user" {
      - arn                  = "arn:aws:iam::172483268424:user/bata-media-frontend-prod-upload-user" -> null
      - force_destroy        = false -> null
      - id                   = "bata-media-frontend-prod-upload-user" -> null
      - name                 = "bata-media-frontend-prod-upload-user" -> null
      - path                 = "/" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - unique_id            = "AIDASQKGNZ5EHHXAPXXOL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.frontend_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment will be destroyed
  # (because aws_iam_user_policy_attachment.upload_user_attachment is not in configuration)
  - resource "aws_iam_user_policy_attachment" "upload_user_attachment" {
      - id         = "bata-media-frontend-prod-upload-user-2025032820223431810000000d" -> null
      - policy_arn = "arn:aws:iam::172483268424:policy/bata-media-frontend-prod-upload-policy" -> null
      - user       = "bata-media-frontend-prod-upload-user" -> null
    }

  # module.processing_queue["prod"].aws_lambda_function.processing_lambda will be updated in-place
  ~ resource "aws_lambda_function" "processing_lambda" {
        id                             = "photo-processing-lambda-prod"
      ~ last_modified                  = "2025-04-10T08:16:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "y412z1AbD0nyRDLG0uYtUNFUMLawV0S6l8qja9jrzsc=" -> "FKWXOcs5wL/GiXwWQqqDdAjEHoeUuP/JT9qNArL/fSE="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Warning: Invalid Attribute Combination

  with aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle,
  on mysql-backup.tf line 24, in resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle":
  24: resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @jonathanjuursema*